{
  "base_model_name_or_path": "sentence-transformers/all-MiniLM-L6-v2",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "lora_alpha": 16,
  "lora_dropout": 0.1,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "target_modules": [
    "query",
    "value"
  ],
  "task_type": null
}